<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
<%@ page language="java" contentType="text/html; charset=utf-8" pageEncoding="utf-8"%>
<%@ taglib prefix = "fmt" uri = "http://java.sun.com/jsp/jstl/fmt" %>

<script>
function hideReview(){
let text = document.getElementsByName("review_text");
text[0].style.display = "none";
}
function showReview(){
let text = document.getElementsByName("review_text");
text[0].style.display = "";
}
</script>

<html>
    <head>
        <meta charset="UTF-8">
        <title>Report</title>
    </head>
    <body>
        <div class="header">
            <jsp:include page="/WEB-INF/jsp/shared/header.jsp"/>
        </div>
        <div class="content">
            <jsp:include page="/WEB-INF/jsp/shared/report.jsp"/>
            <br>
                <div>
                    <form id="review" action="review?id=${report.id}" method="POST">
                        Принять <input type="radio" name="status" value="true" onclick="hideReview()" checked="true"><br>
                        Отклонить <input type="radio" name="status" value="false" onclick="showReview()"><br>
                        <textarea rows="20" cols="135" maxlength="400" form="review" name="review_text" style="display:none;">${report.review}</textarea><br>
                        <input type="submit">
                    </form>
                </div>
            <br>
            <p>* Подається з метою отримання довідки про доходи за інший період, ніж квартальний (річний) податковий (звітний) період.<br />** Зазначається номер календарного місяця, за який подається декларація з позначкою “Довідково”.<br /><sup>1</sup> Серію та номер паспорта зазначають фізичні особи, які мають відмітку у паспорті про право здійснювати будь-які платежі за серією та номером паспорта.<br /><sup>2</sup>&nbsp;Код та назва виду економічної діяльності зазначаються відповідно до Класифікатора видів економічної діяльності (КВЕД). <br /><sup>3</sup> Заповнюється наростаючим підсумком з початку року у гривнях з двома десятковими знаками після коми.<br /><sup>4</sup> Включається:<br />&nbsp;сума доходу, що перевищує обсяги, встановлені підпунктами 1, 2, 3 пункту 291.4 статті 291 глави 1 розділу XIV Податкового кодексу України, у звітному (податковому) періоді;<br />&nbsp;сума доходу, отриманого від провадження діяльності, не зазначеної в реєстрі платників єдиного податку (для першої або другої групи), у звітному (податковому) періоді;<br />&nbsp;сума доходу, отриманого при застосуванні іншого способу розрахунків, ніж передбачено пунктом 291.6 статті 291 глави 1 розділу XIV Податкового кодексу України, у звітному (податковому) періоді;<br />&nbsp;сума доходу, отриманого від здійснення видів діяльності, які не дають права на застосування спрощеної системи оподаткування, у звітному (податковому) періоді;<br />&nbsp;сума доходу, отриманого платниками першої або другої групи від провадження діяльності, яка не передбачена в підпункті 1 або 2 пункту 291.4 статті 291 Кодексу.<br /><sup>5</sup> Заповнюється наростаючим підсумком з початку року (не заповнюється платником податку, що подає декларацію „Довідково”).<br /><sup>6</sup> Заповнюється платником податку, який уточнює податкові зобов’язання (не заповнюється платником податку, що подає декларацію «Довідково»). Для уточнення звітних періодів, що передували періоду запровадження нової форми декларації, у рядку 15 зазначається сума єдиного податку, яка підлягала перерахуванню до бюджету, за даними звітного (податкового) періоду, в якому виявлена помилка (рядок 29 податкової декларації, затвердженої наказом Міністерства фінансів України від 21 грудня 2011 року № 1688 «Про затвердження форм податкових декларацій платника єдиного податку», зареєстрованим у Міністерстві юстиції України 27 грудня 2011 року за № 1533/20271 (у редакції наказу Міністерства фінансів України від 07 листопада 2012 року № 1159)).<br /><sup>7</sup> Зазначається тільки як позитивне значення.<br /><sup>8</sup> Нараховується платником у разі самостійного виявлення факту заниження податкового зобов’язання (пункт 50.1 статті 50 глави 2 розділу ІІ Податкового кодексу України).</p>
        </div>
    </body>
</html>